#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_region.Region: Reading...
aws_s3_object.cloudWebsite_File--static--js--main26fc20fajs_8317AB8C: Refreshing state... [id=/static/js/main.26fc20fa.js]
aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA: Refreshing state... [id=/static/js/main.26fc20fa.js.map]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
aws_dynamodb_table.VotingAppStore_Entries_tfawsdynamodbTableDynamodbTable_76D1C895: Refreshing state... [id=Entries-e91f54ab]
aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040: Refreshing state... [id=/static/js/main.26fc20fa.js.LICENSE.txt]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.ce0f07a42a458a8e8dc18eec16b8d8fa.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8211921e621be72d57bf4f0ce39e1038.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.03b9dd0aba0f4fb3f32fd1c12d69e495.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.8293f579b653c35e0f7c54083b73f4b8.zip]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2cssmap_DFBF7C37: Refreshing state... [id=/static/css/main.e6c13ad2.css.map]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2css_F3967298: Refreshing state... [id=/static/css/main.e6c13ad2.css]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=ybxueh]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 must be replaced
+/- resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      ~ created_date  = "2023-08-08T01:34:36Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:223316951128:dfh6uhtoa0/" -> (known after apply)
      ~ id            = "ybxueh" -> (known after apply)
      ~ invoke_url    = "https://dfh6uhtoa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "076a7fe7f12b1f250e87ace7559720526daf2934" -> "356cda951d1a888c3be459f8af782ddd1d0716f9"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be updated in-place
  ~ resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      ~ deployment_id         = "ybxueh" -> (known after apply)
        id                    = "ags-dfh6uhtoa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E" {
        id     = "terraform-20230727204725916100000001:terraform-20230727204739773400000005"
        name   = "terraform-20230727204739773400000005"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:223316951128:table/Entries-e91f54ab",
                        ]
                    },
                    {
                        Action   = [
                            "dynamodb:Scan",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:us-east-1:223316951128:table/Entries-e91f54ab",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-08T01:34:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:7/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8211921e621be72d57bf4f0ce39e1038.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.2c121236396c01bd26a9798f67482448.zip"
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-08T01:34:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.03b9dd0aba0f4fb3f32fd1c12d69e495.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.1a7fad668ff82a05d2b2b52cb5bd2efd.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-08T01:34:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:3/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.ce0f07a42a458a8e8dc18eec16b8d8fa.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.51d56ca35230a5e3c377bd222efc08cc.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-08T01:34:36.443+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:5/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.8293f579b653c35e0f7c54083b73f4b8.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d56ccbd39c5ea1d218c618386f317036.zip"
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "01105a4de23c409f016695bd8b8a3a8b" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8211921e621be72d57bf4f0ce39e1038.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.8211921e621be72d57bf4f0ce39e1038.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.2c121236396c01bd26a9798f67482448.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/8211921E621BE72D57BF4F0CE39E1038/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/2C121236396C01BD26A9798F67482448/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b2440fb541ff4a5eda7c5f88597557a6" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.03b9dd0aba0f4fb3f32fd1c12d69e495.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.03b9dd0aba0f4fb3f32fd1c12d69e495.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.1a7fad668ff82a05d2b2b52cb5bd2efd.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/03B9DD0ABA0F4FB3F32FD1C12D69E495/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/1A7FAD668FF82A05D2B2B52CB5BD2EFD/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "224d76e88604f73051c79c8f2582d5c4" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.ce0f07a42a458a8e8dc18eec16b8d8fa.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.ce0f07a42a458a8e8dc18eec16b8d8fa.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.51d56ca35230a5e3c377bd222efc08cc.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/CE0F07A42A458A8E8DC18EEC16B8D8FA/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/51D56CA35230A5E3C377BD222EFC08CC/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "47e624d5e7c0627fc62e72cd9fc01f68" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.8293f579b653c35e0f7c54083b73f4b8.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.8293f579b653c35e0f7c54083b73f4b8.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.d56ccbd39c5ea1d218c618386f317036.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/8293F579B653C35E0F7C54083B73F4B8/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/D56CCBD39C5EA1D218C618386F317036/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040 will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040 is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "9c8e4c8f13866e428a080abb8417edd2" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.26fc20fa.js.LICENSE.txt" -> null
      - key                    = "/static/js/main.26fc20fa.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajs_8317AB8C will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--main26fc20fajs_8317AB8C is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajs_8317AB8C" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript; charset=utf-8" -> null
      - etag                   = "195c19300e218ad2f8b4cff843ae547c" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.26fc20fa.js" -> null
      - key                    = "/static/js/main.26fc20fa.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/json; charset=utf-8" -> null
      - etag                   = "84f51bb83c4b84318a9cdca83d72a5fd" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.26fc20fa.js.map" -> null
      - key                    = "/static/js/main.26fc20fa.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainafd9b432jsLICENSEtxt_D85FB25B will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainafd9b432jsLICENSEtxt_D85FB25B" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.afd9b432.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.afd9b432.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainafd9b432js_CD37B9EA will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainafd9b432js_CD37B9EA" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.afd9b432.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.afd9b432.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainafd9b432jsmap_9FA53EA6 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainafd9b432jsmap_9FA53EA6" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.afd9b432.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.afd9b432.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 8 to add, 6 to change, 8 to destroy.

```

</details>
